# WallpaintApplication Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallPaint..::..WallpaintApplication Property
WallPaint Class See Also
---
The property labeled "Application" from the "WallPaint" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WallpaintApplication { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallpaintApplication As String
	Get
```

Visual C++
---
```text
public:
static property String^ WallpaintApplication {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintApplicationType".
# See Also
WallPaint Class
Autodesk.Revit.DB.Visual Namespace